In [ ]:
# Load Data Using Python
import pandas as pd

df = pd.read_csv("../data/raw_employee_data.csv")

df.head()

,emp_id,name,age,gender,department,role,salary,performance_score,join_date,exit_date,location
0,1,Ishaan Patel,29,Other,Operations,Operations Analyst,45795.0,1,2015-04-13,NaN,Pune
1,2,Aarav Verma,34,Male,Operations,Operations Analyst,30860.0,5,2021-08-15,NaN,Chennai
2,3,Saanvi Iyer,35,Female,HR,HR Executive,133694.0,5,2023-01-11,NaN,Bangalore
3,4,Anaya Nair,38,Male,Support,Support Engineer,149879.0,2,2023-07-06,NaN,Kolkata
4,5,Diya Nair,59,Female,Engineering,Software Engineer,140268.0,1,2016-01-15,NaN,Pune

In [ ]:
# Remove special characters
# convert to lowercase, replace spaces with _, remove special chars
df.columns = (
    df.columns.str.strip()
    .str.lower()
    .str.replace(" ", "_")
    .str.replace(r"[^a-zA-Z0-9_]", "", regex=True)
)

In [ ]:
# Remove duplicates
df = df.drop_duplicates()

In [ ]:
# Handle missing values
df["salary"] = df["salary"].fillna(df["salary"].median())
df["department"] = df["department"].fillna("Unknown")
df["age"] = df["age"].fillna(df["age"].median())

In [ ]:
# Convert column data types
df["join_date"] = pd.to_datetime(df["join_date"])
df["exit_date"] = pd.to_datetime(df["exit_date"])

In [ ]:
# Add tenure columns
df["tenure_days"] = (
    df["exit_date"].fillna(pd.Timestamp.today()) - df["join_date"]
).dt.days

df["tenure_years"] = df["tenure_days"] / 365

In [ ]:
# Save cleaned file
df.to_csv("../data/cleaned_employee_data.csv", index=False)

In [ ]:
# Load Data Into PostgreSQL (Python)
from sqlalchemy import create_engine

engine = create_engine("postgresql://postgres:yourpassword@localhost:5432/employee_db")

df.to_sql("employees", engine, if_exists="replace", index=False)

1000